# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'fzf' # Fuzzy finder

# Image optimization tools
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'php' # Latest PHP version (8.4 as of Nov 2025)
brew 'composer'
brew 'php@8.3'
brew 'php@8.2'
brew 'wp-cli' # WordPress CLI
brew 'jq' # JSON processor
brew 'httpie' # HTTP client

# Apps
cask 'arc' # Arc browser
cask 'bitwarden' # Password manager
brew 'bitwarden-cli'
cask 'docker' # Container platform
cask 'figma' # Design tool
cask 'firefox' # Browser
cask 'github' # GitHub Desktop
cask 'google-chrome' # Browser
cask 'imageoptim' # Image compression
cask 'notion' # Notes and docs
cask 'raycast' # Spotlight replacement (recommended for productivity)
cask 'readdle-spark' # Email client
cask 'slack' # Communication
cask 'sequel-ace' # MySQL/MariaDB client
cask 'the-unarchiver' # Archive utility
cask 'visual-studio-code' # Code editor
cask 'monitorcontrol' # External monitor brightness control

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
