# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'fzf'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'

# Apps
cask 'bitwarden'
brew 'bitwarden-cli'
cask 'caffeine'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'herd'
cask 'httpie'
cask 'imageoptim'
cask 'notion'
cask 'pastebot'
cask 'readdle-spark'
cask 'slack'
cask 'sequel-ace'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'monitorcontrol'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'